app/controllers/pins_controller.rb

  def index
    @pins = Pin.order("created_at desc").page(params[:page]).per_page(20)
---
SELECT "pins".* FROM "pins" ORDER BY created_at desc LIMIT 20 OFFSET 0

  def edit
    @pin = current_user.pins.find(params[:id])
---
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = 1 AND "pins"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @pin = current_user.pins.new(params[:pin])

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_remote_url", "image_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @pin = Pin.find(params[:id])

    respond_to do |format|
      if @pin.update_attributes(params[:pin])
---
SELECT "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "pins" SET "image_file_name" = 'tumblr_m4sqbjqID41qzleu4o1_1280.jpg', "image_file_size" = 260474, "image_updated_at" = '2013-05-11 22:20:58.890909', "image_remote_url" = 'http://24.media.tumblr.com/tumblr_m4sqbjqID41qzleu4o1_1280.jpg', "updated_at" = '2013-05-11 22:20:59.107097' WHERE "pins"."id" = 2